[
    {
        "id": 1,
        "image": "cps.png",
        "content":"<p>GoCPS allows families to learn, research, explore, and apply to nearly every CPS school and program through one online platform. The site currently serves over 1 million parents and students annually, providing families with critical information, functioning as the gateway to finding the right school for students. </p><p>JS Technology Solutions provided the initial development as well as ongoing updates, enhancements and support, delivering the technological solutions for Chicago Public Schools' needs using modern technologies such as Angular, Google API, Fusion Tables, and responsive web development. </p><p><a href=\"https://news.wttw.com/2017/05/17/new-gocps-high-school-application-site-goes-live\" target=\"_blank\">View press release</a>.</p><p><a href=\"https://go.cps.edu\" target=\"_blank\">View site</a>.</p>",
        "category": ["Software Development", "UI/UX", "Education"],
        "client": ["Chicago Public Schools"],
        "timeline":"> 2 years",
        "tags": ["Responsive Web Development", "Angular", "Google Maps", "Geolocation", "Typescript"],
        "relatedPost1":{
          "image": "drco.png",
          "id": 6,
          "projectName": "DRCO"
        },
        "relatedPost2":{
          "image": "prospectResources_.png",
          "id": 2,
          "projectName": "Prospect Resources"
        }
    },
    {
      "id": 2,
      "image": "prospectResources_.png",
      "content":"<p>Prospect resources Inc is an energy prospecting and purchasing firm, providing their clients signficant savings on energy costs. Tasked with the challenge of managing a huge amount of incoming data, the team needed a solution to make this data more accessible to employees and customers in a user-friendly fashion.</p><p>Having heard about JS Technology Solutions' expertise in developing data-driven user interfaces, they reached out to begin our collaboration. We began the engagement by analyzing their needs and developing a deep understanding of their data structure, as well as their existing technical architecture. We then proposed and later, delivered an efficient cloud-based solution that sped up their routine reporting processes by over 50%. In addition, we were able to provide training to their in-house staff of analysts so that they could manage the ongoing development and maintenance of the new platform without any external assistance or expenditures.</p>",
      "category": ["Software development", "Business intelligence", "Reporting"],
      "client": ["Prospect Resources"],
      "timeline":"1 Year",
      "tags": ["REST APIs", "SQL", "Data analytics", "PDF Generation"],
      "relatedPost1":{
        "image": "cps.png",
        "id": 1,
        "projectName": "GoCPS"
      },

      "relatedPost2":{
        "image": "mccollege.png",
        "id": 3,
        "projectName": "Midwestern Career College"
      }
    },
    {
      "id": 3,
      "image": "mccollege.png",
      "content":"<p>Midwestern Career College is a community college based on Chicago, IL, providing an outstanding path into a number of key careers. Known for its commitment to providing high quality education, MCC is proud to have graduates placed at trusted companies and organizations throughout the Chicago area and beyond.</p><p>When MCC needed a complete website overhaul, they heard about JS Technology Solutions by word of mouth, and engaged us for a thorough needs assessment and project plan. Working closely with their management team, we iterated on various aspects of the project, from conception to design, to data model, project build, deployment and testing. Our efforts enabled MCC to take complete ownership of the ongoing site maintenance after the project was completed. Most importantly, the site carries the branding and theming requirements of MCC, emphasizing the school's focus on updated technology and providing value to its students, their families, and communities.</p><p><a href=\"http://mccollege.edu\" target=\"_blank\">View site</a></p>",
      "category": ["Software development", "Education", "UI/UX"],
      "client": ["Midwestern Career College"],
      "timeline":"6 months",
      "tags": ["Wordpress", "CMS", "Plugin Development and Customization", "3rd party integrations"],
      "relatedPost1":{
        "image": "prospectResources_.png",
        "id": 2,
        "projectName": "Prospect Resources"
      },

      "relatedPost2":{
        "image": "opinionwizard.png",
        "id": 4,
        "projectName": "Opinion Wizard"
      }
    },
    {
      "id": 4,
      "image": "opinionwizard.png",
      "content":"<p>Opinionwizard is a paid survey and research service. Highly customized for the client's needs, the system streamlines and automates a powerful search and selection process that targets, notifies and tracks participants throughout a full lifecycle of engagement in research projects. </p><p>Starting from the initial engagement, and working closely with stakeholders over several years, we were able to take ownership of a loosely-developed codebase, bringing it under source control, implementing package management, and providing critical refactors to enable long-term growth and performance of the product. The refactor/rebuild process included implementation of agile/scrum methodologies based on JIRA, alongside tighter controls on environment and deployment.</p><p> Within the first year, the company was able to correct many critical issues that impacted business needs, and begin a steady process of iteration and deployment of enhancements and features. Later, we built a mobile app to provide a simplified experience for end-users, enabling them to pre-qualify for research studies, track loyalty points earned, receive push notifications related to events they've signed up for, and more. </p><p><a href=\"https://www.opinionwizard.com\" target=\"_blank\">View site</a></p>",
      "category": ["Software development", "Business Solutions", "CRM", "Marketing"],
      "client": ["Precision Research"],
      "timeline":"> 2 years",
      "tags": ["RESTful APIs", "Angular", "MySQL", "Filemaker", "Google Maps API", "SMS", "Reporting", "Geolocation"],
      "relatedPost1":{
        "image": "mccollege.png",
        "id": 3,
        "projectName": "Midwestern Career College"
      },

      "relatedPost2":{
        "image": "enduracare.png",
        "id": 5,
        "projectName": "AR PROACTIVE"
      }
    },
    {
      "id": 5,
      "image": "enduracare.png",
      "content":"<p>Following an initial round of funding and product development, AR Proactive was seeking a new development team to help grow and scale their platform to serve a rapidly expanding customer base. Following initial efforts focused on discovery, data architecture, and code analysis, it became clear that company growth was being significantly impacted by the complex manual processes involved in monthly data loads from a wide variety of 3rd party systems.</p><p>Working closely together with key stakeholders, we delivered multiple enhancement phases, delivering an automated ETL solution that abstracted complex, error-prone ETL processes. At the same time, we were able to architect and implement a powerful, customizable configuration solution that provided the in-house team with direct controls into the automation pipeline, freeing up key personnel to focus on growing a scaling the company.</p><p><a href=\"https://www.arproactive.com\" target=\"_blank\">Visit site</a></p>",
      "category": ["Software Development", "Healthcare", "Compliance"],
      "client": ["AR PROACTIVE"],
      "timeline":"> 2 years",
      "tags": ["RESTful APIs", "MySQL", "DevOps", "ETL", "Angular", "3rd party integrations"],
      "relatedPost1":{
        "image": "opinionwizard.png",
        "id": 4,
        "projectName": "Opinion Wizard"
      },

      "relatedPost2":{
        "image": "drco.png",
        "id": 6,
        "projectName": "DRCO"
      }
    },
    {
        "id": 6,
        "image": "drco.png",
        "content":"<p>DRCO is an intuitively designed, web-based intervention support system currently under development for K-12 schools. DRCO provides educators, intervention specialists, and school-based mental health professionals the tools needed for a wide variety of high quality behavior supports.</p><p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/0PEeJ5hPWqs\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>",
        "category": ["Software development", "UI/UX", "Education", "Compliance"],
        "client": ["Seed Protocol"],
        "timeline":"1 year",
        "tags": ["RESTful APIS", "Angular", "Laravel", "MySQL", "PDF Generation", "AWS"],
        "relatedPost1":{
            "image": "enduracare.png",
            "id": 5,
            "projectName": "AR PROACTIVE"
        },

        "relatedPost2":{
            "image": "cps.png",
            "id": 1,
            "projectName": "GoCPS"
        }
    }
]
